<?php
//header('content-type:text/html;charset=utf-8');

/**汉字转拼音
 * @param string $str 要转拼音的字串
 * @param bool   $ucCase 是否首字母大写。
 * @param string $clearEmpty 是否清除字串中的空格。使拼音成为连贯。
 * @param int    $nullPad 对无法转成拼音的字处理方式：1、使用■代替比较醒目，方便手工处理。2、采用原字符。3、其它非1和2的字符，表示用此字符代替不可转成拼音的字符。
 * @param string $code 网站编码
 */
class PinyinModel {
	function pinyin($str, $ucCase = false, $clearEmpty = true, $nullPad = '', $code = 'UTF-8') {
		if (empty($str))
			return $str;
		$py = '|啊阿吖锕:a|埃挨哎唉哀皑癌蔼暧矮瑷艾碍爱霭砹嫒隘锿捱嗳:ai|鞍氨安俺按暗岸庵桉胺案谙鹌埯揞铵犴黯:an|肮昂盎:ang|凹敖熬翱袄傲奥坳懊鳌骜鏊廒遨聱螯鏖媪嗷岙獒澳:ao|芭捌扒叭吧笆八疤巴拔跋靶把耙坝霸罢爸岜粑茇菝魃灞鲅:ba|白柏百摆佰败拜稗捭:bai|斑班搬扳般颁板版扮拌伴瓣半坂阪办绊瘢癍钣舨:ban|邦帮梆榜膀绑棒磅蚌镑傍浜谤蒡:bang|苞胞包褒薄雹保堡饱宝葆抱报暴豹鲍爆煲鸨孢龅褓:bao|杯碑悲卑北辈背贝钡倍狈备惫焙邶碚陂蓓被孛鹎悖褙鐾鞴呗:bei|贲奔坌苯本笨锛畚:ben|崩绷甭泵蹦迸嘣甏:beng|逼鼻比鄙笔彼碧蓖蔽毕毙毖币庇痹闭敝弊必辟壁臂弼避璧俾匕陛荸妣秕舭荜萆薜哔狴庳愎滗濞婢嬖畀铋筚箅篦襞跸髀:bi|鞭边编贬扁便变匾卞辨辩汴辫遍煸砭蝙笾鳊碥窆褊弁苄忭:bian|标彪膘镖飚表飙飑镳瘭婊裱鳔:biao|鳖憋别瘪蹩:bie|彬斌濒滨鬓槟宾傧摈豳缤镔殡膑髌:bin|邴兵冰柄丙秉饼炳病并禀摒:bing|玻菠播拨钵波博勃搏铂箔伯帛舶脖膊渤泊驳踣剥亳啵饽趵礴钹鹁跛檗掰擘簸:bo|捕卜哺补埠不布步钚簿部怖逋晡钸醭卟瓿:bu|擦礤:ca|猜裁材才财睬踩采彩菜蔡:cai|璨餐参蚕残惭惨粲灿骖黪:can|苍舱仓藏沧伧:cang|操糙槽曹漕草嘈漕螬艚:cao|厕策侧册测恻:ce|岑涔:cen|层蹭:ceng|插叉茬茶查碴搽察岔槎差诧姹汊猹檫镲杈衩嚓馇锸:cha|拆柴豺钗侪虿:chai|禅掺蝉馋谗缠铲觇产阐颤廛潺澶孱婵蟾躔冁谄蒇骣忏羼:chan|昌猖场尝常长偿肠厂敞畅唱伥倡嫦苌昶惝氅鬯怅菖阊娼鲳徜:chang|超抄钞朝嘲潮巢吵炒晁怊耖:chao|车扯撤掣彻澈砗坼:che|郴臣辰尘晨忱沉陈琛宸趁衬抻嗔谌碜谶榇龀:chen|丞撑称城橙成呈乘程惩塍澄诚埕承逞骋秤噌柽瞠蛏枨铖酲裎:cheng|吃痴持匙池迟弛驰耻齿侈尺赤翅斥啻笞傺茌叱炽哧嗤媸眵鸱蚩螭魑墀篪踟褫豉彳饬敕瘛:chi|充冲虫崇宠茺忡憧舂艟铳翀:chong|抽酬畴踌稠愁筹瘳仇绸瞅丑俦臭惆雠:chou|初出橱厨躇锄雏滁除楚础储矗搐触亍处褚樗刍蜍蹰杵楮怵憷绌黜:chu|揣踹搋膪:chuai|川穿椽传船喘串氚巛遄舡舛钏:chuan|疮窗幢床闯创怆:chuang|吹炊捶锤垂陲棰槌:chui|春椿醇唇淳纯蠢蝽莼鹑:chun|戳龊绰踔啜辍:chuo|疵茨磁雌辞祠慈瓷词此刺赐次鹚糍:ci|聪葱囱匆琮从丛苁骢璁淙:cong|凑楱辏腠:cou|粗醋簇促蹙蔟猝蹴徂殂:cu|蹿篡窜汆撺镩爨:cuan|璀摧崔萃催萃脆瘁粹淬翠榱啐悴毳:cui|村存寸皴忖:cun|磋撮搓措挫蹉厝错嵯矬痤瘥鹾脞锉:cuo|搭达答瘩打怛大妲耷哒褡笪靼鞑:da|呆歹傣戴带殆代贷袋岱待逮埭黛怠甙迨绐玳:dai|耽担丹单郸掸胆旦氮但儋惮淡诞弹蛋殚眈聃箪赕疸萏啖瘅:dan|当挡党荡档谠铛凼菪宕砀裆:dang|刀捣蹈倒岛祷导到稻悼道盗氘忉帱纛:dao|德得的锝:de|蹬灯登等瞪凳邓噔簦戥嶝磴镫:deng|堤低滴迪敌笛狄狄涤嫡抵底地蒂第帝坻弟递缔邸娣氐谛诋籴嘀砥羝荻觌镝柢骶棣碲睇:di|嗲:dia|颠掂滇碘点典靛垫电佃甸店惦奠淀殿癫巅踮巓坫玷癜簟:dian|碉叼雕凋刁掉吊钓调貂鲷铞:diao|跌爹碟蝶迭谍叠耋垤堞揲牒瓞蹀鲽:die|丁盯叮钉顶鼎锭酊定仃订玎疔耵啶腚碇:ding|丢铥:diu|东冬董懂动栋侗恫冻洞咚岽氡鸫胨胴硐:dong|钭兜抖斗陡豆逗痘都窦蔸篼蚪:dou|笃督毒犊独读堵睹赌杜镀肚度渡妒牍嘟渎椟髑黩芏蠹:du|端短锻段断缎椴煅簖:duan|堆兑队对怼憝碓:dui|墩吨蹲敦顿囤钝沌炖盾遁礅镦盹趸砘:dun|掇哆多夺垛躲朵跺舵踱剁惰堕咄裰铎哚缍沲:duo|蛾峨鹅俄额讹娥恶厄扼噩遏鄂垩饿屙婀莪锇谔苊萼愕轭腭锷鹗颚鳄呃:e|诶:ei|恩蒽嗯摁:en|而儿耳尔饵洱佴二贰铒鲕迩珥鸸:er|发罚筏伐乏阀垡法砝珐:fa|藩帆番翻樊矾钒繁凡烦反返范贩犯饭泛梵幡璠蕃蘩燔蹯畈:fan|坊芳方肪房防妨仿访舫纺邡匚放枋钫鲂:fang|菲霏非啡飞肥匪斐诽吠肺废沸费妃翡芾绯扉鲱淝腓悱榧蜚篚狒镄痱:fei|芬酚吩氛分纷坟焚汾粉奋份偾忿愤粪玢棼鼢瀵鲼:fen|丰封枫蜂峰锋风疯烽逢冯缝讽俸奉凤酆沣砜唪葑:feng|佛:fo|否缶:fou|夫敷肤孵扶拂辐幅氟符伏俘服浮涪福袱弗甫抚辅俯釜斧脯腑府腐赴副覆赋复傅付阜父腹负富讣附妇罘缚芙巿咐孚驸褔凫匐馥呋麸趺跗郛苻茯菔幞怫艴绂绋桴祓砩黻稃蚨蜉蝠拊滏黼赙蝮鲋鳆:fu|噶旮嘎尬尜钆尕:ga|该改概钙盖丐溉陔垓赅戤:gai|干甘杆柑竿肝赶感秆敢赣尴坩苷泔矸疳酐擀澉橄淦绀旰:gan|冈刚钢缸肛纲岗港杠罡筻:gang|郜篙皋高膏羔糕搞镐稿藁睾诰告槔缟槁杲锆:gao|哥歌搁戈鸽胳疙割革葛格蛤阁隔铬个鬲圪袼塥嗝搿膈镉骼哿舸虼各:ge|给:gei|根跟艮亘哏茛:gen|耕更庚羹埂耿梗赓哽绠鲠:geng|工攻功恭龚供躬公宫弓巩汞拱贡觥共肱蚣珙:gong|钩勾沟苟狗垢构枸彀购佝够缑篝鞲岣笱诟遘媾觏:gou|辜菇咕箍估沽孤姑鼓古蛊骨谷股故顾毂固雇梏嘏崮牿锢痼鲴菰轱鸪酤觚诂汩牯臌瞽罟钴蛄:gu|刮瓜剐寡挂卦胍鸹呱诖:gua|褂:gua|乖拐匦刿怪:guai|棺关官冠观管馆罐惯莞倌灌贯鳏掼涫盥鹳:guan|光广犷逛咣胱桄:guang|瑰规圭硅归龟闺轨鬼诡癸桂柜跪眭贵刽妫皈鲑庋宄晷簋鳜:gui|辊滚棍衮绲磙鲧:gun|锅郭国果裹过埚呙崞聒蝈馘掴帼虢猓椁蜾:guo|哈铪:ha|骸孩海氦亥害骇胲醢:hai|酣憨邯韩含涵寒函喊罕翰撼捍旱憾悍焊汗邗汉瀚晗顸蚶鼾焓菡撖颔:han|夯杭航绗颃沆:hang|壕嚎豪毫郝蒿好耗昊号皓浩濠薅嚆嗥蚝灏颢:hao|呵喝荷菏核禾和何合盒貉阂河涸赫褐壑鹤贺诃嗬劾阖纥曷盍颌翮:he|嘿嗨黑:hei|痕很狠恨:hen|哼亨横衡恒蘅珩桁:heng|轰哄烘虹鸿洪宏弘泓红闳讧訇薨黉荭蕻:hong|喉侯猴吼厚候鲎后瘊篌糇骺堠後逅:hou|呼乎忽瑚壶葫胡蝴扈狐糊湖弧虎唬护互沪琥鹄浒斛户醐唿惚滹轷烀囫猢槲觳煳鹕鹘冱岵怙戽祜瓠鹱笏:hu|花哗华猾滑画划化桦话骅铧:hua|槐徊怀淮坏踝:huai|欢环桓还缓换患唤痪豢焕涣浣奂宦寰幻獾萑洹缳锾鬟擐漶逭鲩:huan|荒慌黄磺蝗簧皇凰惶煌晃幌恍徨谎肓隍湟潢遑璜癀蟥篁鳇:huang|灰挥辉徽恢蛔回毁悔慧卉惠晦贿秽会烩汇讳诲蕙荟绘晖麾诙咴隳茴洄虺蕙哕喙彗缋桧恚蟪:hui|荤昏婚魂浑诨珲混馄溷阍:hun|豁活伙火获或惑霍货祸劐攉锪耠夥钬藿嚯镬蠖:huo|蓟暨霁稷击圾基机畸稽积箕肌饥迹激讥鸡姬绩缉吉极棘辑籍集及急疾汲即嫉级挤几脊己嵇技冀季伎祭剂悸济寄寂计记既忌际妓继纪笈芨岌犄玑偈羁剞亟乩佶墼叽咭唧屐畿赍齑矶笄跻蒺蕺嵴楫殛戢瘠掎戟虮麂芰哜洎骥觊跽鲚鲫髻:ji|嘉枷夹佳家加荚颊贾甲钾假稼价架驾嫁迦郏袈葭笳珈浃镓痂跏戛恝铗蛱岬胛:jia|歼监坚尖笺间煎兼肩艰奸缄茧检柬碱硷拣捡简俭剪减笕荐槛鉴践贱见键箭件健舰剑饯渐溅涧建锏趼翦谏僭菅蒹搛湔缣戋鹣鲣鞯谫蹇謇枧戬睑裥耩楗牮毽腱踺:jian|僵姜将浆江疆蒋桨奖讲犟匠酱降茳缰礓豇洚绛糨:jiang|蕉椒礁焦胶交郊浇骄娇嚼搅铰矫侥脚狡角饺皎缴绞剿教酵轿滘姣较蛟叫佼僬跤窖艽茭鹪鲛挢敫噍徼醮:jiao|揭接皆秸街阶截劫节桔杰捷睫竭洁结解姐戒藉芥界借介疥诫届桀婕碣颉拮诘讦喈疖孑羯鲒蚧骱:jie|巾筋斤金今津襟紧锦仅谨进靳晋禁近烬瑾浸尽劲觐缙璟衿卺堇馑槿荩噤妗赆:jin|荆兢茎睛晶鲸京惊精粳经井警景颈泾静境敬镜旌径婧痉靖竟竞净刭憬刭儆菁阱腈肼獍迳弪胫:jing|炯冂窘炅扃迥:jiong|揪究纠玖韭久灸九酒厩救旧臼舅咎僦就疚啾阄鸠赳鬏柩桕鹫:jiu|鞠拘狙疽居驹菊局咀矩举沮聚拒据巨具距踞锯俱琚句惧飓炬倨遽剧雎苴掬椐裾鞫橘锔莒榉踽龃讵屦榘犋钜窭醵:ju|捐鹃娟鄄倦眷卷绢涓蠲镌锩狷桊:juan|撅攫抉掘倔爵觉决厥蕨诀绝崛劂蹶噱珏嗟噘谲矍獗孓桷橛爝镢觖:jue|均菌钧军君峻俊竣浚桾隽郡骏筠皲捃:jun|喀咖咯佧卡咔胩:ka|开揩楷凯剀恺铠慨锎垲蒈锴忾:kai|阚刊堪勘坎砍看侃戡龛莰瞰:kan|康慷糠扛伉抗亢闶钪炕:kang|考拷烤犒靠尻栲铐:kao|坷苛柯棵磕颗科壳咳可渴克珂轲刻嵙客课瞌钶稞疴窠蝌髁颏岢嗑恪溘骒缂氪锞蚵:ke|肯啃垦恳裉:ken|坑吭铿:keng|空恐孔控倥崆箜:kong|抠口扣叩寇芤眍蔻筘:kou|枯哭窟苦酷库刳裤绔堀骷喾:ku|夸垮挎跨胯侉:kua|蒯块筷侩快郐哙狯浍脍:kuai|宽髋款:kuan|匡筐狂框矿眶旷况邝圹诓哐诳夼纩贶:kuang|亏盔岿窥葵奎魁傀馈愧溃匮逵馗夔揆喹暌睽蝰跬蒉喟愦聩篑:kui|坤昆捆困琨锟醌鲲髡悃阃:kun|括扩廓阔栝蛞:kuo|垃拉喇蜡腊辣剌旯啦邋砬瘌:la|莱籁来崃赖徕涞铼濑赉睐癞:lai|蓝婪栏拦篮阑兰澜谰揽览懒缆烂滥斓岚榄镧褴漤榄罱:lan|琅榔狼廊郎朗浪啷锒稂螂蒗阆:lang|捞劳牢老佬崂姥酪烙涝铹痨醪栳铑唠耢:lao|簕仂勒乐叻泐鳓:le|雷镭蕾磊累儡垒擂肋类泪羸嫘缧檑诔耒酹嘞:lei|棱楞冷塄愣:leng|郦厘梨犁黎篱狸离漓理李里鲤礼莉荔吏栗丽厉励砾历利傈例俐痢立粒沥隶坜力璃哩莅俚蠡俪蛎骊笠雳蓠藜喱嫠缡罹鹂蜊鲡黧悝澧逦娌锂醴鳢坜苈呖唳猁溧枥轹戾砺詈疠疬篥粝跞:li|俩:lia|联莲连镰廉怜涟帘敛脸链恋琏炼练奁濂臁裢蠊鲢蔹裣潋楝殓:lian|粮凉梁粱良两辆量晾亮踉谅靓墚莨椋魉:liang|撩聊僚疗燎寥辽潦了撂镣寮廖料嘹獠缭鹩尥钌:liao|列裂烈劣猎冽埒捩洌趔躐鬣咧:lie|蔺琳林磷霖临邻鳞淋凛赁吝躏拎麟啉嶙遴辚瞵粼廪懔檩膦:lin|玲菱零龄铃伶羚凌灵翎陵岭领苓另令酃囹泠绫柃棂瓴聆蛉鲮呤:ling|溜琉榴硫馏留刘瘤镠流柳浏鎏六熘骝旒绺锍遛镏鹨:liu|龙聋咙笼窿隆垅垄拢陇珑茏栊胧砻癃:long|楼娄搂篓漏蒌偻陋喽耧蝼髅嵝镂瘘:lou|逯芦卢颅庐炉掳卤虏鲁麓碌露路赂泸鹿潞禄鹭录璐陆戮轳氇撸噜垆栌胪鸬舻鲈橹镥蓼渌漉辂辘簏:lu|驴吕铝侣旅榈履屡缕虑氯律率滤绿膂稆褛闾:lv|栾峦挛孪滦卵乱銮脔娈鸾:luan|掠略锊:lue|抡轮伦仑沦纶论囵:lun|萝螺罗逻锣箩骡裸落洛雒骆泺漯珞倮络捋猡椤脶镙蠃瘰荦摞硌:luo|妈麻玛码蚂马骂嘛吗嬷蟆犸唛杩:ma|埋买麦卖迈脉霾荬劢:mai|瞒馒蛮满蔓曼慢漫幔谩缦颟鳗鞔螨墁熳镘:man|芒茫盲氓忙莽邙硭漭蟒:mang|猫茅锚毛矛铆卯茂牦冒帽貌贸懋昴旄蝥髦茆耄袤峁泖瑁瞀蟊:mao|么:me|玫枚梅酶霉煤没眉媒镁每莓美昧寐妹媚魅嵋湄猸楣镅鹛浼袂:mei|门闷扪钔焖懑们:men|萌蒙檬盟锰猛勐梦甍瞢朦礞虻艨懵蜢蠓艋孟:meng|宓眯醚靡糜迷谜弥米秘觅泌蜜密縻幂芈咪蘼猕麋弭脒敉谧嘧汨糸:mi|棉眠绵冕免勉娩缅面沔湎腼眄:mian|缪苗描瞄藐秒渺邈庙妙淼喵鹋缈杪眇:miao|蔑咩蠛篾灭:mie|民抿皿敏悯闽旻岷闵珉玟苠缗泯愍黾鳘:min|明螟鸣铭眀名命冥酩茗溟暝瞑:ming|谬:miu|摸摹蘑模膜磨摩魔抹末莫墨默沫茉漠寞秣陌蓦谟馍嫫麽殁镆瘼耱貊貘:mo|谋眸牟鍪某侔哞蛑:mou|拇牡亩姆母墓暮幕募慕木目睦牧仫穆沐毪坶苜钼:mu|拿哪呐钠那娜纳镎捺肭衲:na|氖乃奶耐奈鼐艿萘柰:nai|南楠囡囝男难喃腩蝻赧:nan|囊攮馕曩囔:nang|挠脑恼闹孬淖呶猱硇铙蛲垴瑙:nao|呢讷:ne|馁内:nei|嫩:nen|能:neng|妮霓倪泥尼拟你匿腻逆昵旎溺伲坭猊怩铌鲵祢睨:ni|蔫拈年碾撵捻廿念黏鲇鲶辇埝:nian|娘酿:niang|鸟袅尿茑嬲脲:niao|乜捏聂孽啮镊镍涅陧蘖嗫颞臬蹑:nie|您恁:nin|柠狞凝佞宁拧泞咛甯聍:ning|牛扭钮纽妞狃忸拗:niu|脓浓农侬弄哝:nong|耨:nou|奴驽努怒孥弩胬钕恧衄:nu|女:nv|暖:nuan|虐疟:nue|挪懦糯诺傩搦锘:nuo|哦噢:o|欧鸥殴藕呕讴偶沤瓯耦怄:ou|啪趴爬葩杷帕怕琶钯筢:pa|拍排牌俳徘湃派蒎哌:pai|攀潘盘磐盼畔判叛爿蟠蹒泮袢襻:pan|乓庞旁耪胖滂彷逄螃:pang|抛咆刨炮袍跑泡匏狍庖疱脬:pao|呸胚培裴赔陪配佩沛旆霈锫辔帔醅:pei|喷盆湓:pen|砰抨烹澎彭蓬棚硼篷膨朋鹏捧碰嘭怦堋蟛:peng|坯砒霹批披劈琵毗啤脾疲皮匹痞僻屁枇邳丕譬仳陴郫埤鼙芘罴铍裨蚍蜱貔圮擗吡庀癖淠媲甓睥噼纰:pi|篇偏片骗翩犏骈缏胼蹁谝:pian|飘漂瓢剽票螵嫖莩缥殍瞟嘌骠:piao|撇氕瞥苤:pie|拼频贫品聘拚姘嫔榀颦牝:pin|乒坪苹萍平凭瓶评屏俜娉枰鲆:ping|坡泼颇婆破魄迫叵粕鄱剖攴钋皤钷笸珀:po|裒掊:pou|璞扑铺仆莆葡菩蒲埔朴圃普浦谱曝蹼瀑匍濮噗镤溥氆镨:pu|期欺栖戚妻七凄漆柒沏其棋奇歧畦崎脐齐旗祈祁骑起岂乞企启契砌器气迄弃汽泣讫琦琪憩琦麒祺杞岐亓耆绮芑颀丌綦骐萋嘁桤槭芪荠萁蕲淇蛴蜞鳍屺葺汔碛:qi|掐恰洽葜袷髂:qia|牵扦钎铅千迁签仟谦乾黔钱钳前潜遣浅谴堑嵌芊茜倩欠虔愆佥歉阡岍悭骞搴褰荨掮犍钤箝缱肷芡椠:qian|枪呛腔羌墙蔷跄强抢戕锖锵蜣嫱樯镪襁羟戗炝:qiang|樵橇锹敲悄桥瞧乔硚侨巧鞘撬翘劁峭俏窍硗跷荞峤憔鞒愀诮谯:qiao|郄切茄且伽怯妾窃惬慊挈锲箧趄:qie|钦侵亲秦琴勤芹芩擒禽寝沁衾嗪噙廑檎锓矜螓揿吣:qin|青轻氢箐倾卿清擎晴氰情顷请庆蜻圊謦罄檠黥苘磬綮:qing|琼邛銎筇穷茕穹蛩跫:qiong|裘秋丘邱萩球求囚虬酋俅泅湫楸蚯鳅巯犰逑遒赇糗:qiu|瞿璩麴趋区蛆曲躯屈驱衢渠取娶龋趣诎去岖觑劬蕖蘧氍朐磲鸲癯蠼祛蛐黢苣阒:qu|圈颧权醛泉全痊拳犬券劝悛诠荃辁铨蜷筌鬈绻畎:quan|阙缺炔瘸却鹊榷确雀阕悫:que|裙群麇逡:qun|然燃冉髯染蚺苒:ran|瓤壤攘嚷禳让穰:rang|饶扰娆绕荛桡:rao|惹热喏:re|壬仁人忍韧任荏认仞刃妊纫稔饪轫衽:ren|扔仍:reng|日:ri|戎茸蓉荣融熔溶容绒冗嵘榕狨肜蝾:rong|揉柔蹂糅鞣肉:rou|茹蠕儒孺如辱乳汝入褥薷嚅濡铷襦颥蓐洳溽缛:ru|软阮朊:ruan|芮蕊瑞锐睿蕤枘蚋:rui|闰润:run|若偌弱箬:ruo|撒洒卅萨仨飒脎:sa|腮鳃塞赛噻:sai|三叁伞散毵馓:san|桑嗓丧搡磉颡:sang|搔骚扫缫鳋埽臊瘙嫂:sao|瑟啬穑色铯涩:se|森:sen|僧:seng|莎砂杀刹沙纱痧啥霎裟煞铩鲨唼歃:sha|筛晒:shai|珊苫杉山删煽衫闪陕擅赡膳善跚鄯汕扇缮埏芟潸姗膻舢髟讪嬗骟钐疝蟮鳝:shan|墒伤商赏晌上尚裳殇熵觞垧绱:shang|梢捎稍烧芍勺韶少哨劭邵绍筲艄杓潲:shao|厍奢赊蛇舌舍赦摄射慑涉社设佘猞畲滠麝:she|莘燊申呻伸身深娠绅神沈审婶甚肾慎诜渗糁谂哂渖矧葚胂珅蜃什:shen|声昇生甥牲升绳省盛剩胜嵊晟圣晟渑笙眚:sheng|师失狮施湿诗尸虱十石拾时食蚀实识史矢使屎驶始式示士世柿事拭誓逝势是嗜噬适仕侍释饰氏市泗恃室鲥视试蓍酾鲺埘炻豕谥莳弑轼贳铈螫舐筮:shi|收手首守寿授售受瘦兽艏狩绶:shou|蔬枢梳殊抒输叔舒淑疏书赎孰熟薯暑曙署蜀黍鼠属术述树束戍竖墅庶数漱恕纾塾澍殳倏菽摅姝毹秫沭腧:shu|刷耍唰:shua|摔衰甩帅蟀:shuai|栓拴涮闩:shuan|霜双爽泷孀:shuang|谁水睡税:shui|吮瞬顺舜:shun|说硕朔烁蒴搠妁槊铄:shuo|斯撕嘶思私司丝死肆寺嗣四伺似饲厮巳俟厶咝澌缌锶鸶蛳兕汜姒驷祀耜笥:si|松耸怂颂送嵩宋讼淞诵凇菘崧悚竦:song|搜艘擞飕嗽嗖馊溲锼螋叟薮嗾瞍:sou|苏酥俗素速粟僳塑溯宿诉谡肃稣夙蔌嗉愫涑簌觫:su|酸蒜算狻:suan|虽隋随绥髓碎岁穗遂隧濉邃祟荽睢谇燧:sui|孙损笋荪狲飧榫隼:sun|蓑梭唆缩琐索娑锁所嗦嗍桫挲睃羧唢:suo|塌他它她塔獭榻挞蹋溻遢趿嗒闼沓鳎踏:ta|邰胎钛苔抬台泰酞太态跆汰肽骀炱鲐呔薹:tai|覃澹坍摊贪瘫滩坛檀痰潭谭谈坦毯袒碳探叹炭昙忐郯锬钽:tan|汤塘搪堂棠膛唐糖倘躺淌趟烫傥铴耥羰溏瑭樘镗螗螳醣帑:tang|掏涛滔绦萄韬桃鼗逃淘陶焘讨套叨啕洮饕:tao|忑特慝铽:te|滕藤腾疼誊:teng|梯剔踢锑提题蹄啼体替嚏惕悌涕倜剃屉醍缇鹈逖绨裼:ti|天添填田甜恬舔阗腆畋钿忝殄掭:tian|挑条迢眺窕佻跳祧苕蜩笤龆鲦髫粜:tiao|贴铁帖餮萜:tie|厅听烃汀廷停婷亭庭挺艇蜓葶霆莛町铤梃:ting|通桐峒酮瞳同铜彤童桶捅佟筒僮仝统痛嗵垌茼潼砼恸:tong|偷投头透骰:tou|凸秃突图徒途涂屠土吐兔钍堍菟荼酴:tu|湍团抟疃彖:tuan|推颓腿蜕褪退忒煺:tui|吞屯氽臀暾饨豚:tun|拖托脱鸵陀驮驼椭妥沱拓乇唾佗坨柁橐砣铊酡跎鼍庹柝箨:tuo|挖哇蛙洼娃瓦袜佤娲腽:wa|歪外:wai|豌弯湾玩顽丸剜烷完碗挽晚皖惋宛婉万腕蜿琬纨芄绾脘畹:wan|汪王亡枉网往旺罔望忘妄惘辋魍:wang|隗威巍微危韦违桅围唯惟为潍维苇萎委伟伪尾纬未蔚味畏胃喂魏位渭韪谓囗炜娓尉玮圩慰薇倭偎帷帏卫隈葳崴逶煨嵬闱沩涠诿猥洧痿艉鲔猬軎:wei|雯瘟温蚊文闻纹吻稳紊刎汶问阌璺:wen|嗡翁蓊蕹瓮:weng|挝蜗渥涡窝我斡卧握幄龌沃莴喔肟硪:wo|巫呜钨乌污诬屋无芜梧吾吴毋武五捂午舞伍侮坞戊雾晤物勿务悟鹉骛误鹜兀邬鋈妩仵圬唔浯蜈鼯庑怃忤迕牾阢芴寤婺杌焐痦:wu|郤郗昔熙析西硒矽晰嘻吸锡牺稀息希悉膝夕惜熄烯溪汐犀檄袭席习媳嬉喜铣洗系隙戏羲细奚玺僖樨禧曦熹蹊翕睎兮皙菥唏浠淅欷歙穸蜥螅蟋舾粞醯鼷隰觋葸蓰徙屣饩阋禊舄:xi|瞎虾匣霞辖暇峡侠狭下厦夏瑕呷吓狎遐柙硖瘕黠罅:xia|掀锨先仙鲜纤咸贤衔舷闲涎弦嫌显险现献县腺馅羡宪娴暹冼陷限氙苋痫霰线莶祆籼酰跹鹇藓猃燹蚬筅跣岘彡:xian|相厢镶香箱襄湘乡翔祥详想响享项巷橡葙骧缃饷鲞蟓庠像向象芗飨:xiang|萧硝霄削哮嚣销消宵淆晓小孝校肖骁啸笑枭潇效崤筱逍哓绡枵蛸箫魈筱:xiao|楔些歇蝎鞋协挟携邪斜胁谐写械卸蟹榭懈泄勰亵泻谢屑燮絜偕撷缬薤獬廨渫瀣邂绁榍躞:xie|薪芯锌欣辛新忻心信衅昕鑫囟馨歆镡:xin|星腥猩惺兴刑型形邢行醒幸杏性陉姓饧硎擤荇悻:xing|兄凶胸匈汹芎雄熊:xiong|休修羞朽嗅锈秀袖绣岫溴咻馐庥鸺貅髹:xiu|胥墟戌需虚嘘须徐许蓄酗叙旭序畜恤絮栩煦婿绪续诩顼砉盱糈醑勖洫溆蓿:xu|轩萱喧宣悬旋玄选癣眩谖绚瑄煊暄璇渲炫儇揎漩痃泫楦碹铉镟:xuan|靴薛学穴雪血泶踅鳕谑:xue|荀勋熏循旬询寻驯巡浔殉汛训薰讯逊巽迅埙獯曛醺郇峋恂洵鲟蕈徇:xun|压押鸦鸭呀丫芽牙蚜崖衙涯雅娅哑亚讶伢垭桠岈琊睚痖疋揠迓氩砑:ya|闫焉咽阉烟淹盐严研蜒岩延言颜阎炎沿奄掩眼衍演艳堰燕厌砚雁唁彦焰宴偃谚验郾妍琰晏厣剡俨兖赝餍魇湮焱菸崦恹阏嫣胭腌阽檐筵罨鼹鼽谳滟酽鄢:yan|殃央鸯秧杨扬佯疡羊洋阳氧仰痒养炀样漾泱徉蛘怏烊鞅恙:yang|邀腰妖瑶摇尧遥窑谣姚夭咬舀药要曜吆爻窈幺徭珧轺肴铫鳐崾杳鹞耀:yao|椰噎耶爷野冶也页掖业叶曳腋夜液邺谒靥晔揶铘烨:ye|羿一壹医揖铱依伊衣颐夷遗移仪胰疑沂宜姨彝椅蚁倚已乙矣以艺抑易邑屹亿役臆逸肄疫亦裔意毅忆义益溢诣议谊译异翼翌怡轶绎贻薏懿奕旖廙弈翳驿刈劓仡佚咿猗漪欹黟诒圯荑咦嶷饴眙痍苡迤钇舣酏埸挹弋呓嗌噫峄怿悒缢殪熠镒镱瘗癔翊蜴佾:yi|茵荫因殷音阴姻吟银淫寅饮尹引鄞胤隐氤印霪瘾茚窨堙喑洇铟圻垠狺夤龈吲蚓:yin|英瀛樱婴鹰应缨莹萤营郢荧蝇迎赢盈鹦影颖硬映嬴莺瑛罂撄嘤膺璎茔荥萦蓥滢潆楹瘿颍媵:ying|唷哟:yo|拥佣臃痈庸雍踊蛹咏泳涌永恿俑勇用壅墉慵邕镛鳙饔喁甬:yong|幽优悠忧尤由邮铀犹油游酉有友右宥佑釉诱又柚莜卣攸侑幼呦莸尢猷疣蚰蝣蝤鱿莠牖铕黝囿蚴鼬:you|於迂淤于盂榆虞愚舆余俞逾鱼愉渝渔隅予娱雨与屿禹宇语羽玉域芋郁吁遇喻峪御愈欲狱育誉浴寓裕预豫驭庾妤瑜妪毓禺昱谕雩俣煜龉伛纡瘀谀萸揄嵛狳馀觎腴欤窬蝓竽臾舁圄圉瘐窳菀蓣饫阈鬻燠聿钰鹆鹬蜮:yu|鸳渊冤元垣袁原援辕园员圆猿源缘远苑愿芫怨媛院眢鸢箢塬圜沅橼爰螈鼋垸掾瑗:yuan|曰约越跃玥钥岳粤月龠悦瀹栎樾刖钺阅:yue|耘云郧匀陨允运蕴酝昀晕韵郓氲芸孕纭狁殒恽愠韫熨:yun|匝砸杂咂:za|栽哉灾宰载再在甾崽:zai|昝咱攒暂簪糌拶趱瓒錾赞:zan|赃脏驵葬臧:zang|遭糟凿藻枣早澡蚤躁噪造皂缲唣灶燥:zao|责择昃仄则赜泽啧帻迮箦舴:ze|贼:zei|谮怎:zen|增憎罾缯甑锃曾赠:zeng|扎喳渣札轧铡闸眨栅榨咋乍炸吒揸哳楂齄诈:zha|摘斋宅窄债翟寨砦瘵:zhai|瞻毡詹粘沾盏斩辗崭展蘸栈占战站旃湛绽搌谵:zhan|樟章彰漳璋张掌涨杖丈帐账仗幛嶂胀鄣獐嫜璋蟑瘴障仉:zhang|招昭找沼赵照罩诏喋砟咤痄蚱兆肇召棹笊钊:zhao|遮折哲蛰辙者锗蔗这柘谪摺辄磔蜇褶赭鹧浙喆:zhe|珍斟真甄砧臻贞针侦枕疹诊震振祯镇阵圳赈浈溱椹榛胗箴缜轸畛鸩朕稹蓁桢:zhen|蒸挣铮睁征狰争怔整拯正政帧症钲鲭郑诤筝峥证:zheng|芝枝支吱蜘知肢脂汁之织职直植殖执值侄址指止趾只旨纸志挚掷至致置帜峙制智秩枳稚质炙痔滞彘芷治窒卮踯絷郅桎栀胝祗埴摭跖徵咫轵祉黹酯陟帙忮骘栉轾贽膣雉鸷痣蛭踬豸觯:zhi|中盅忠钟衷终种螽肿重仲忪锺舯冢踵众:zhong|舟周州洲诌粥轴肘帚咒皱宙昼胄纣骤啁妯碡荮绉籀繇酎:zhou|竺珠株蛛朱猪诸诛逐竹烛煮拄瞩嘱主著柱助蛀贮铸筑住邾注祝驻伫洙潴槠橥铢瘃舳躅渚麈苎杼炷疰箸茱翥侏:zhu|抓爪:zhua|拽:zhuai|专砖转撰颛啭馔赚篆:zhuan|桩庄装妆撞壮奘戆状:zhuang|椎锥追赘坠缀骓隹惴缒:zhui|谆肫窀准:zhun|捉拙卓桌琢茁涿酌啄着倬焯诼擢浞濯禚斫镯灼浊:zhuo|訾兹咨资姿滋淄孜紫仔籽滓子自渍秭姊字梓谘呲嵫孳缁辎赀锱粢趑龇鲻髭茈耔笫恣眦:zi|鬃棕踪宗综总纵偬粽枞腙:zong|邹走奏揍诹陬鄹驺鲰:zou|租足卒族祖诅阻组菹镞俎:zu|钻纂躜缵攥:zuan|嘴醉最觜蕞罪:zui|尊遵樽鳟撙:zun|昨左柞祚做作座笮阼唑怍胙祚酢嘬坐佐:zuo|';
		//这几个偏旁部首暂不使用：勹亠冫冖讠阝廴凵艹廾扌卩犭夂饣忄丬氵宀辶彐屮纟攵灬礻肀钅疒衤虍亻刂呒
		$ret = '';

		$encodeLen = (strtoupper($code) == 'UTF-8') ? 3 : 2;
		for ($i = 0; $i < strlen($str); $i++) {
			//1、获得字符串
			$s = substr($str, $i, 1);
			$asc = ord($s);
			if ($asc > 0 && $asc < 128) {
				$ret .= $s;
				continue;
			}
			if ($asc > 0xa0) {
				$s = substr($str, $i, $encodeLen);
				$i += ($encodeLen - 1);
			}

			//2、取得拼音
			if (stripos($py, $s) !== false) {
				$start = stripos($py, ':', stripos($py, $s) + 1) + 1;
				$end = stripos($py, '|', stripos($py, $s) + 1);

				$ret .= $ucCase ? ucfirst(substr($py, $start, $end - $start)) : substr($py, $start, $end - $start);
				//首字母大写
			} elseif ($nullPad == 1)//是否要提示没有生成拼音，要提示的话，生成“■”方便识别。
			{
				$ret .= '■';
			} elseif ($nullPad == 2)//采用原字符。
			{
				$ret .= $s;
			} else//使用指定字符
			{
				$ret .= $nullPad;
			}
		}
		if ($clearEmpty)
			$ret = str_replace(' ', '', $ret);
		return trim($ret, ' 　');
	}

	//core::loadSysFuns('pinyin');
	//$str = "[中国人]【abc123】";
	//echo pinyin($str);
}
